In [1]:
import pandas as pd

In [2]:
data = {
    "Company" : ["SCG","SCG","PTT","PTT","PTT","KTB"],
    "Person" :["A","B","C","D","E","F"],
    "Sale" :[200,120,300,125,250,350]
}

data

{'Company': ['SCG', 'SCG', 'PTT', 'PTT', 'PTT', 'KTB'],
 'Person': ['A', 'B', 'C', 'D', 'E', 'F'],
 'Sale': [200, 120, 300, 125, 250, 350]}

In [4]:
df = pd.DataFrame(data=data)
df

  Company Person  Sale
0     SCG      A   200
1     SCG      B   120
2     PTT      C   300
3     PTT      D   125
4     PTT      E   250
5     KTB      F   350

In [7]:
by_compy = df.groupby("Company")
by_compy.mean()

          Sale
Company
KTB      350.0
PTT      225.0
SCG      160.0

In [8]:
by_compy.std()

              Sale
Company
KTB            NaN
PTT      90.138782
SCG      56.568542

In [9]:
by_compy.describe()

         Sale
        count   mean        std    min    25%    50%    75%    max
Company
KTB       1.0  350.0        NaN  350.0  350.0  350.0  350.0  350.0
PTT       3.0  225.0  90.138782  125.0  187.5  250.0  275.0  300.0
SCG       2.0  160.0  56.568542  120.0  140.0  160.0  180.0  200.0

In [11]:
by_compy.describe().transpose()['PTT']

Sale  count      3.000000
      mean     225.000000
      std       90.138782
      min      125.000000
      25%      187.500000
      50%      250.000000
      75%      275.000000
      max      300.000000
Name: PTT, dtype: float64